In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

### lambda 함수 : 한줄의 리턴 코드 가지는 함수를 간단히 작성

In [16]:
def square(x):
    return x* x

square(5)

25

In [19]:
# lambda 활용하면 1줄로 
square_2 = lambda x: x*x
square_2(5)

25

In [23]:
def add10(x):
    y = 10;     return x+y
add10(5)

15

In [22]:
# lambda 내에서는 변수 생성 불가
add10_2 = lambda x: y=10; x+y
add10_2(5)

SyntaxError: cannot assign to lambda (1521027477.py, line 2)

In [24]:
# 단, 람다 표현식 밖의 변수는 사용 가능
y = 10
add10_3 = lambda x: x+y
add10_3(5)

15

In [37]:
# lambda에서 if else 활용
evensquare = lambda x: x * x if x % 2 == 0 else x
print(evensquare(8))
print(evensquare(9))

64
9

### map, applymap, apply 비교
|             | map                    | applymap   | apply                     |
|:------------|:-----------------------|:-----------|:--------------------------|
| Object      | Series                 | DataFrame  | Series, DataFrame         |
| Argument    | Dict, Series, callable | callable   | callable                  |
| Elementwise | O                      | O          | O                         |
| Aggregation | X                      | X          | O                         |
| 활용사례    | 변환, 매핑             | 변환       | 좀더 복잡한 함수          |
| 반환값      | Series                 | DataFrame  | Scalar, Series, DataFrame |

### map 활용 : Series의 각 값에 임의의 함수를 적용한 후 1차원 배열로 돌려줌

In [2]:
# 샘플 데이터프레임 생성
np.random.seed(1004)
df1 = pd.DataFrame(np.random.randn(4, 3)*100, columns=['x1','x2','x3'], index=['A','B','C','D'])
display(df1)

           x1          x2         x3
A   59.440307   40.260871 -80.516223
B   11.512570  -75.306522 -78.411780
C  146.157577  157.607553 -17.131776
D  -91.448182   86.013945  35.880192

In [3]:
# map 메서드로 기본함수 적용하기
df1.x1.map(np.sqrt)

D:\python\python-3.9.10.amd64\lib\site-packages\pandas\core\base.py:890: RuntimeWarning: invalid value encountered in sqrt
  new_values = map_f(values, mapper)

A     7.709754
B     3.393018
C    12.089565
D          NaN
Name: x1, dtype: float64

In [4]:
# 사용자 정의 함수 적용하기
def point2(x):
    return '%.2f'%x

df1.x1.map(point2)

A     59.44
B     11.51
C    146.16
D    -91.45
Name: x1, dtype: object

In [5]:
# lambda로 사용 가능
f02 = lambda x: '%.2f'%x
df1.x1.map(f02)

A     59.44
B     11.51
C    146.16
D    -91.45
Name: x1, dtype: object

In [6]:
# 사용자 정의 함수에 복수 인자 넣을 경우에는 lambda로만 가능, 소수점 자리수 그때그때 지정하기
def pointn(x, y):
    return f'%.{y}f'%x

df1.x1.map(lambda x: pointn(x, 3))

A     59.440
B     11.513
C    146.158
D    -91.448
Name: x1, dtype: object

In [7]:
# map(function. sequence) : 함수 형식으로 적용, 각 시퀀스마다 함수 적용
list(map(lambda x: x*x, range(10, 20)))

[100, 121, 144, 169, 196, 225, 256, 289, 324, 361]

In [8]:
# 사용자 정의 함수 적용
list(map(point2, df1.x1))

['59.44', '11.51', '146.16', '-91.45']

### applymap 활용 : DataFrame의 각 값에 임의의 함수를 적용한 후 2차원 배열로 돌려줌

In [9]:
df1.applymap(f02)

       x1      x2      x3
A   59.44   40.26  -80.52
B   11.51  -75.31  -78.41
C  146.16  157.61  -17.13
D  -91.45   86.01   35.88

### apply 활용 : DataFrame에 대해 row/column 로 함수 적용

In [10]:
df1

           x1          x2         x3
A   59.440307   40.260871 -80.516223
B   11.512570  -75.306522 -78.411780
C  146.157577  157.607553 -17.131776
D  -91.448182   86.013945  35.880192

In [11]:
df1.apply(max, axis=1)

A     59.440307
B     11.512570
C    157.607553
D     86.013945
dtype: float64

In [12]:
f = lambda x: x.max() - x.min()
df1.apply(f)  # axis = 0 생략 가능

x1    237.605758
x2    232.914075
x3    116.396416
dtype: float64

In [13]:
df1.apply(f, axis = 1)

A    139.956530
B     89.924350
C    174.739328
D    177.462127
dtype: float64

In [14]:
df1.apply(f, 1)  # axis 문구 생략 가능

A    139.956530
B     89.924350
C    174.739328
D    177.462127
dtype: float64

In [15]:
# 여러 값 리턴시 Series 사용
f2 = lambda x: pd.Series([x.min(), x.max()], index=['min','max'])
df1.apply(f2)

             x1          x2         x3
min  -91.448182  -75.306522 -80.516223
max  146.157577  157.607553  35.880192